app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
---
SELECT "carts".* FROM "carts"

  def show
    begin
      @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 30 Aug 2012 17:04:27 UTC +00:00], ["updated_at", Thu, 30 Aug 2012 17:04:27 UTC +00:00]]

  def update
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190962]]