app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items"
---
  def index
    @line_items = LineItem.all

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @line_item = LineItem.find(params[:id])

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @line_item = LineItem.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "207281424"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 30 Aug 2012 17:28:27 UTC +00:00], ["updated_at", Thu, 30 Aug 2012 17:28:27 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Fri, 31 Aug 2012 17:58:15 UTC +00:00], ["product_id", 207281424], ["quantity", 1], ["updated_at", Fri, 31 Aug 2012 17:58:15 UTC +00:00]]
UPDATE "line_items" SET "updated_at" = '2012-08-31 14:39:48.468496', "quantity" = 4 WHERE "line_items"."id" = 40
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @line_item = LineItem.find(params[:id])

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]
---
  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy